%单纯形法求解目标规划问题，采用分层、逐次利用单纯形法求解
%须将目标规划化为标准形式
%输入项：A为约束方程组系数矩阵；b为约束方程右端项
%c为达成函数依优先目标按行输入，即c的第一行是第一优先目标,不考虑优先因子时的目标函数
%c的第二行是只考虑第二优先目标(不考虑优先因子)时的目标函数，把第一优先级P1（前面的更高的优先的已经达成的目标）作为硬约束加入A
%c的第三行是只考虑第三优先目标时的目标函数，把优先级P2（前面的更高的优先的已经达成的目标）作为硬约束加入A
%以下类推

function x=pGoalProg(A,b,c)
[m0,n0]=size(A);
[m1,n1]=size(c);
if n1~=n0
	disp('目标函数矩阵输入有误')
	return
end
for i=1:m1
    %调用第二章单单纯形法求解 线性规划，目标规划求偏差最小，实际调用求负的目标函数最大，c取相反数 -c(i,:)'
	[xstar,fxstar,A0,IB,iter]=MMSimplex(A,b,-c(i,:)');
    disp('显示增加约束前的模型--------------------------------');
    disp(A);
    disp(b);
    
    %%%%TODO Put the Code for Problem  at below %%%%
    %已经达成的目标作为硬约束加入A
	A(m0+i,:)=c(i,:)
    
    %约束等式的右端常数项
    b(m0+i)=-fxstar;
    disp('显示增加约束后的模型+++++++++++++++++++++++++++++++++');
    disp(A);
    disp(b);
end
x=xstar;